from math import factorial



f=factorial
print ("你知道:这声音从何而来:我需要这声音不需要那声音:因为狐狸:猴子:是不会说话的",f(119)/(f(10)*f(119-10)))
print ("你知道:这声音从何而来:我需要这声音不需要那声音:因为狐狸:猴子:是不会说话的",f(118)/(f(10)*f(118-10)))
print ("你知道:这声音从何而来:我需要这声音不需要那声音:因为狐狸:猴子:是不会说话的",f(117)/(f(10)*f(117-10)))
"组合数增加"
r=f(119)/(f(10)*f(119-10))-f(117)/(f(10)*f(117-10))
rr=f(118)/(f(10)*f(118-10))-f(117)/(f(10)*f(117-10))
rrr=f(119)/(f(10)*f(119-10))-f(118)/(f(10)*f(118-10))


print (r)
print (rr)
print (rrr)
#print (r-rr)
#print (r-rr)

d=round(1.765,2)
print (d)
print (3.5+7.1)
x=2.1+4.2
print (x)

#热烈庆祝DOTA英雄组合数上升至10e15#你真的验证过了那些不可能出现的组合数了吗
#得到这个数,和计算加速这个计算书的方案,是完完全全的交并补差集两个办法
#你的垃圾桶累计到底多少了?
from math import factorial

def f(n):
	if n==0:
		return 1
	else:
		return n*f(n-1)
print ("117选10:",f(117)/(f(10)*f(107)))
print ("",f(117)/(f(9)*f(108)))
print ("",f(117)/(f(8)*f(109)))
print ("",f(117)/(f(7)*f(110)))
print ("",f(117)/(f(6)*f(111)))
print ("117选5:",f(117)/(f(5)*f(112)))
print ("",f(117)/(f(4)*f(113)))

print (f(200)/(f(10)*f(115)))

print ("119选5:",f(119)/(f(5)*f(112)))
print ("129选5:",f(119)/(f(5)*f(112)))
