sum=1
"容器"
print (80*33*55,"cm3")
print (80*33*55*5,"cm3")
"重量"
print (25.8)
"钱"

prenotification="2020/12/22日,我应该至少拥有的存款是{},如果期间就参加工作,我用的存款应该更多还是稍微少点,如果期间学习效果没有达到预期,那么存款应该还是稍微少点"


mymoney=(13000+5446.13)-(270+15+35+130+59+20)*12
print (prenotification.format(mymoney))
# print (prenotification.format(13000+5446.13+800*8+860+382.39)#450的房租150的水电
"总资产+备用资产"


"面积"
print (4.5*3.3)
print (3.5*3.5)

print ("网费",59+11*59-11*20)

print ("音浪:",83000/10)
print ("音浪:",143000/10)
print ("音浪:",130000/10)
print ("音浪:",520/10)
print("粉丝团:",2880)
print("抖音粉丝:",1.5e6)


print ((1e7-1000)/25)
